# StructuralSectionUserDefined Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSectionUserDefined Class
Members See Also
---
Defines parameters for parameterized user defined structural section.
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public class StructuralSectionUserDefined : StructuralSectionRectangular
```

Visual Basic
---
```text
Public Class StructuralSectionUserDefined _
	Inherits StructuralSectionRectangular
```

Visual C++
---
```text
public ref class StructuralSectionUserDefined : public StructuralSectionRectangular
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSection Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionRectangular Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionUserDefined
# See Also
StructuralSectionUserDefined Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace